tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "hudochenkov/sshpass"
# Record and share terminal sessions
brew "asciinema"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Statistics utility to count lines of code
brew "cloc"
# Tool for exploring each layer in a docker image
brew "dive"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Work with remote images registries
brew "skopeo"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Process YAML documents from the CLI
brew "yq"
brew "hudochenkov/sshpass/sshpass"
# E-books management software
cask "calibre"
# Universal database tool and SQL client
cask "dbeaver-community"
cask "go2shell"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Image optimization tool
cask "optimage"
# Control your tools with a few keystrokes
cask "raycast"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
mas "CotEditor", id: 1024640650
mas "Eye Monitor", id: 1527031341
mas "GIPHY CAPTURE", id: 668208984
mas "iShot", id: 1485844094
mas "Kindle", id: 405399194
mas "OneDrive", id: 823766827
mas "Reeder", id: 1449412482
mas "Unsplash Wallpapers", id: 1284863847
mas "微信", id: 836500024
