tap "homebrew/bundle"
tap "hudochenkov/sshpass"
tap "j178/tap"
# Record and share terminal sessions
brew "asciinema"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Linter and formatter to improve copywriting, correct spaces, words between CJK
brew "autocorrect"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# Tool for exploring each layer in a docker image
brew "dive"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Trim your git remote tracking branches that are merged or gone
brew "git-trim"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Work with remote images registries
brew "skopeo"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
brew "hudochenkov/sshpass/sshpass"
# leetgo is a command line tool for leetcode.com. It can help you to login, submit, test, and view your submissions.
brew "j178/tap/leetgo"
# GPU-accelerated terminal emulator
cask "alacritty"
# Universal database tool and SQL client
cask "dbeaver-community"
# Opens a terminal window to the current directory in Finder
cask "go2shell"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Image optimisation tool
cask "optimage"
# Control your tools with a few keystrokes
cask "raycast"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
mas "Bob", id: 1630034110
mas "CotEditor", id: 1024640650
mas "GIPHY CAPTURE", id: 668208984
mas "iShot", id: 1485844094
mas "Kindle Classic", id: 405399194
mas "OneDrive", id: 823766827
mas "Unsplash Wallpapers", id: 1284863847
mas "微信", id: 836500024
mas "腾讯会议", id: 1484048379
vscode "4ops.packer"
vscode "flippidippi.flippidippi-theme"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "golang.go"
vscode "joaompinto.vscode-graphviz"
vscode "labuladong.leetcode-helper"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-yaml"
vscode "searking.preview-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
